Merge pull request #46 from HNGM-HP/beta
Beta
